import PostSummaryCardMolecule from "@/components/molecule/PostSummaryCard";
import {CBox} from "@/components/atom/Box";

export interface Props {

}

export default function PostSummaryBody(props: Props) {
    return (
        <CBox>
            <PostSummaryCardMolecule
                createdAt={"2023-01-11"}
                updatedAt={"2023-01-11"}
                title={"제목입니다.제목입니다.제목입니다.제목입니다.제목입니다."}
                tags={["리액트", "파이썬", "데이터 베이스"]}
                summary={"요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다." +
                    "요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다."
                }
            />

            <PostSummaryCardMolecule
                createdAt={"2023-01-11"}
                updatedAt={"2023-01-11"}
                title={"제목입니다.제목입니다.제목입니다.제목입니다.제목입니다."}
                tags={["리액트", "파이썬", "데이터 베이스"]}
                summary={"요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다." +
                    "요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다.요약입니다."
                }
            />
        </CBox>

    )
}